Repository: supseven-at/theme-base
Catalog: Resources/Private/Language/*.locallang_formFields.xlf
Languages: de

# element.city.properties.label
source: Place / Location / City
de: Ort

# element.city.properties.placeholder
source: e.g. Vienna, Berlin, ...
de: z.B. Wien, Berlin, ...

# element.company.properties.label
source: Company
de: Firma

# element.company.properties.placeholder
source: e.g. John Doe Ltd.
de: z.B. Max Mustermann GmbH

# element.country.properties.label
source: Country
de: Land

# element.country.properties.placeholder
source: e.g. Austria, Germany, ...
de: z.B. Österreich, Deutschland, ...

# element.country.properties.prependOptionLabel
source: Please choose ...
de: Bitte wählen ...

# element.email.properties.label
source: E-mail address
de: E-Mail Adresse

# element.email.properties.placeholder
source: e.g. john.doe@domain.com
de: z.B. max.mustermann@domain.com

# element.firstname.properties.label
source: First name
de: Vorname

# element.firstname.properties.placeholder
source: e.g. John
de: z.B. Max

# element.lastname.properties.label
source: Last name
de: Nachname

# element.lastname.properties.placeholder
source: e.g. Doe
de: z.B. Mustermann

# element.legalNotice.properties.label
source: I agree that my personal data will be stored and processed by %2$s. I have the right to withdraw my consent to personal data processing anytime by e-mail or letter to %2$s. I have read the %1$s for further information about data processing and my rights.
de: Ich bin damit einverstanden, dass meine Daten von %2$s gespeichert und verwendet werden dürfen. Ich kann jederzeit meine Zustimmung per E-Mail widerrufen. Weitere Informationen zur Verarbeitung meiner Daten sowie zu meinen Rechten habe ich der %1$s entnommen.

# element.message.properties.label
source: Message
de: Nachricht

# element.message.properties.placeholder
source: Hello, I have a request regarding ...
de: Guten Tag, ich habe eine Frage zu ...

# element.phone.properties.label
source: Phone number
de: Telefonnummer

# element.phone.properties.placeholder
source: e.g. 0043 660 1234567
de: z.B. 0043 660 1234567

# element.salutation.properties.label
source: Salutation
de: Anrede

# element.salutation.properties.placeholder
source: e.g. Mr., Ms., ...
de: z.B. Herr, Frau

# element.salutation.properties.prependOptionLabel
source: Please choose ...
de: Bitte wählen ...

# element.street.properties.label
source: Address
de: Straße

# element.street.properties.placeholder
source: e.g. Main street
de: z.B. Hauptstrasse

# element.streetnumber.properties.label
source: House number
de: Hausnummer

# element.streetnumber.properties.placeholder
source: e.g. 123
de: z.B. 123

# element.title.properties.label
source: Title
de: Titel

# element.title.properties.placeholder
source: e.g. Dr., Prof., ...
de: z.B. Dr., Prof., ...

# element.zip.properties.label
source: Zip code
de: Postleitzahl

# element.zip.properties.placeholder
source: e.g. 1010
de: z.B. 1010

# finisher.MailIntrotext.headerReceiver
source: New message
de: Neue Nachricht

# finisher.MailIntrotext.headerSender
source: Thank you for your message.
de: Vielen Dank für Ihre Nachricht.

# finisher.MailIntrotext.textReceiver
source: Enclosed you will find the transmitted data.<hr>
de: Anbei erhalten Sie die übermittelten Daten.<hr>

# finisher.MailIntrotext.textSender
source: We will process your request as quickly as possible and get back to you shortly.<hr>
de: Wir werden Ihr Anliegen schnellstmöglich bearbeiten und uns in Kürze bei Ihnen melden.<hr>

# mail.legal_notice_accepted
source: Privacy policy accepted.
de: Datenschutzerklärung akzeptiert.

# validation.error.city.1221560718
source: Please enter a city.
de: Bitte geben Sie eine Stadt an.

# validation.error.company.1221560718
source: Please enter a company.
de: Bitte geben Sie eine Firma an.

# validation.error.country.1221560718
source: Please enter a country.
de: Bitte geben Sie ein Land an.

# validation.error.email.1221560718
source: Please enter an e-mail address.
de: Bitte geben Sie eine E-Mail Adresse an.

# validation.error.firstname.1221560718
source: Please enter a first name.
de: Bitte geben Sie einen Vornamen an.

# validation.error.lastname.1221560718
source: Please enter a last name.
de: Bitte geben Sie einen Nachnamen an.

# validation.error.legalNotice.1221560718
source: Please accept the privacy policy.
de: Bitte akzeptieren Sie die Datenschutzbestimmungen.

# validation.error.message.1221560718
source: Please enter a message.
de: Bitte geben Sie eine Nachricht an.

# validation.error.phone.1221560718
source: Please enter a phone.
de: Bitte geben Sie eine Telefonnummer an.

# validation.error.salutation.1221560718
source: Please enter a salutation.
de: Bitte geben Sie eine Anrede an.

# validation.error.street.1221560718
source: Please enter an address.
de: Bitte geben Sie eine Straße an.

# validation.error.streetnumber.1221560718
source: Please enter a house number.
de: Bitte geben Sie eine Hausnummer an.

# validation.error.title.1221560718
source: Please enter a title.
de: Bitte geben Sie einen Titel an.

# validation.error.zip.1221560718
source: Please enter a zip code.
de: Bitte geben Sie einen Postleitzahl an.
